In [2]:
import numpy as np
import pandas as pd

In [22]:
data={'Company':['GooG','GooG','MSFT','MSFT','FB','FB'],
      'Person':['SAM','CHARLIE','AMY','VANESSA','CARL','SARAH'],
      'Sales':[200,120,340,124,243,350]}

In [23]:
df=pd.DataFrame(data)

In [24]:
df

  Company   Person  Sales
0    GooG      SAM    200
1    GooG  CHARLIE    120
2    MSFT      AMY    340
3    MSFT  VANESSA    124
4      FB     CARL    243
5      FB    SARAH    350

In [25]:
byComp=df.groupby('Company')

In [26]:
byComp.mean()

C:\Users\Siddhar15632\AppData\Local\Temp\ipykernel_24084\1270089407.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  byComp.mean()

         Sales
Company
FB       296.5
GooG     160.0
MSFT     232.0

In [27]:
byComp.sum()

C:\Users\Siddhar15632\AppData\Local\Temp\ipykernel_24084\310972714.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  byComp.sum()

         Sales
Company
FB         593
GooG       320
MSFT       464

In [28]:
byComp.std()

C:\Users\Siddhar15632\AppData\Local\Temp\ipykernel_24084\3568384627.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  byComp.std()

              Sales
Company
FB        75.660426
GooG      56.568542
MSFT     152.735065

In [29]:
byComp.sum().loc['FB']

C:\Users\Siddhar15632\AppData\Local\Temp\ipykernel_24084\287118459.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [30]:
df.groupby('Company').sum().loc['FB']

C:\Users\Siddhar15632\AppData\Local\Temp\ipykernel_24084\3563751855.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [31]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GooG          2      2
MSFT          2      2

In [32]:
df.groupby('Company').max()

          Person  Sales
Company
FB         SARAH    350
GooG         SAM    200
MSFT     VANESSA    340

In [33]:
df.groupby('Company').min()

          Person  Sales
Company
FB          CARL    243
GooG     CHARLIE    120
MSFT         AMY    124

In [37]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GooG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0